Задачи:

1. Напишете програма, която извежда дали въведена цифра е четно или нечетно число. Използвайте switch.

2. Напишете програма, в която потребителя въвежда число, след което на екрана се изписва това число на кой месец от годината съответства.

3. Да се напише програма, която приема две цели числа и един от символите +, -, *, / или %. Ако символът, който е въведен е един от тях, да се извърши съответната операция върху двете числа. В противен случай да се изведе съобщение за невалиден символ.

4. Да се въведен число от конзолата и да се определи броят на цифрите му.

5. Да се напише програма, която въвежда числа докато не се въведе 0 и изчислява прозведението им.

6. Да се напише програма, която въвежда числа от клавиатурата до въвеждането на 0 и намира средното им аритметично.

7. Eдно число се нарича перфектно, ако е равно на сумата от всичките си делители.
Например 6=1+2+3, 28=1+2+4+7+14. Напишете програма, която въвежда число и проверява дали е перфектно.

8. Въведете реалното число x и естественото число n. Напишете програма, която пресмята сумата:

	s = 1 + x/1! + (x^2)/2! + ... (x^n)/n!

9. Да се състави програма, която извежда всички естествени трицифрени числа, които нямат еднакви цифри.

10. Да се напише програма, която отпечатва всички делители на въведено от потребителя число число.


